# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [42]:
import pandas as pd
import numpy as np
df1 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")

In [43]:
df2 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv")

In [44]:
df3 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv")

In [45]:
# Here some changes that I have to do because I had problems doing it after.

In [46]:
df1.rename(columns={"ST": "State"}, inplace=True) 
df2.rename(columns={"ST": "State"}, inplace=True) 
df3.rename(columns={"Gender": "GENDER"}, inplace=True)

In [47]:
# Combine the three datasets
df = pd.concat([df1, df2, df3], axis=0, keys=["Table 1", "Table 2", "Table 3"])
df

             Customer       State GENDER             Education  \
Table 1 0     RB50392  Washington    NaN                Master
        1     QZ44356     Arizona      F              Bachelor
        2     AI49188      Nevada      F              Bachelor
        3     WW63253  California      M              Bachelor
        4     GA49547  Washington      M  High School or Below
...               ...         ...    ...                   ...
Table 3 7065  LA72316  California      M              Bachelor
        7066  PK87824  California      F               College
        7067  TD14365  California      M              Bachelor
        7068  UP19263  California      M               College
        7069  Y167826  California      M               College

             Customer Lifetime Value   Income  Monthly Premium Auto  \
Table 1 0                        NaN      0.0                1000.0
        1                 697953.59%      0.0                  94.0
        2                1288743.17%  48767.0                 108.0
        3                 764586.18%      0.0                 106.0
        4                 536307.65%  36357.0                  68.0
...                              ...      ...                   ...
Table 3 7065             23405.98798  71941.0                  73.0
        7066             3096.511217  21604.0                  79.0
        7067             8163.890428      0.0                  85.0
        7068             7524.442436  21941.0                  96.0
        7069             2611.836866      0.0                  77.0

             Number of Open Complaints     Policy Type  Vehicle Class  \
Table 1 0                       1/0/00   Personal Auto  Four-Door Car
        1                       1/0/00   Personal Auto  Four-Door Car
        2                       1/0/00   Personal Auto   Two-Door Car
        3                       1/0/00  Corporate Auto            SUV
        4                       1/0/00   Personal Auto  Four-Door Car
...                                ...             ...            ...
Table 3 7065                         0   Personal Auto  Four-Door Car
        7066                         0  Corporate Auto  Four-Door Car
        7067                         3  Corporate Auto  Four-Door Car
        7068                         0   Personal Auto  Four-Door Car
        7069                         0  Corporate Auto   Two-Door Car

              Total Claim Amount
Table 1 0               2.704934
        1            1131.464935
        2             566.472247
        3             529.881344
        4              17.269323
...                          ...
Table 3 7065          198.234764
        7066          379.200000
        7067          790.784983
        7068          691.200000
        7069          369.600000

[12074 rows x 11 columns]

In [48]:
df.shape

(12074, 11)

In [49]:
# Convert columns names to in lower case
df.columns = df.columns.str.lower()

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 12074 entries, ('Table 1', 0) to ('Table 3', 7069)
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   state                      9137 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer lifetime value    9130 non-null   object
 5   income                     9137 non-null   float64
 6   monthly premium auto       9137 non-null   float64
 7   number of open complaints  9137 non-null   object
 8   policy type                9137 non-null   object
 9   vehicle class              9137 non-null   object
 10  total claim amount         9137 non-null   float64
dtypes: float64(3), object(8)
memory usage: 1.4+ MB

In [51]:
# Check all the information
df["gender"].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [52]:
# Arrange inconsistent values in gender column 
df = df.replace(to_replace=["Femal", "female"], value='F')
df = df.replace(to_replace=["Male"], value='M')

# Arrange inconsistent values in state column 
df = df.replace(to_replace=["WA", "AZ","Cali"], value=["Washington","Arizona","California"])

# Arrange inconsistent values in education column 
df = df.replace(to_replace=["Bachelors"], value='Bachelor')

# Delete the % character in Customer Lifetime Value column 
df['customer lifetime value'] = df['customer lifetime value'].str.replace('%', '')

# Arrange inconsistent values in vehicle class column  
df = df.replace(to_replace=["Sports Car", "Luxury SUV", "Luxury Car"], value='Luxury')

In [53]:
# Customer lifetime value should be numeric
df["customer lifetime value"] = df["customer lifetime value"].astype("float")

In [54]:
df["customer lifetime value"] = df["customer lifetime value"].round(2) # Round decimals

In [55]:
df["total claim amount"] = df["total claim amount"].round(2)

In [56]:
df["number of open complaints"].unique() # Examine the different values in the column 'Number of open complaints'.

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan, 0,
       2, 3, 1, 5, 4], dtype=object)

In [57]:
# Convert column 'Number of open complaints' to the appropriate data type (numeric)
df['number of open complaints'] = df['number of open complaints'].str.split('/').str[1].astype(float)

In [58]:
df.shape

(12074, 11)

In [59]:
df.head()

          customer       state gender             education  \
Table 1 0  RB50392  Washington    NaN                Master
        1  QZ44356     Arizona      F              Bachelor
        2  AI49188      Nevada      F              Bachelor
        3  WW63253  California      M              Bachelor
        4  GA49547  Washington      M  High School or Below

           customer lifetime value   income  monthly premium auto  \
Table 1 0                      NaN      0.0                1000.0
        1                697953.59      0.0                  94.0
        2               1288743.17  48767.0                 108.0
        3                764586.18      0.0                 106.0
        4                536307.65  36357.0                  68.0

           number of open complaints     policy type  vehicle class  \
Table 1 0                        0.0   Personal Auto  Four-Door Car
        1                        0.0   Personal Auto  Four-Door Car
        2                        0.0   Personal Auto   Two-Door Car
        3                        0.0  Corporate Auto            SUV
        4                        0.0   Personal Auto  Four-Door Car

           total claim amount
Table 1 0                2.70
        1             1131.46
        2              566.47
        3              529.88
        4               17.27

In [60]:
#Delete duplicates rows
df_drop_duplicates = df.drop_duplicates()
df = df_drop_duplicates.copy() # Save it

In [61]:
# Check for duplicates after cleaning
duplicated_rows_after_cleaning = df.duplicated()
duplicated_rows_after_cleaning

Table 1  0       False
         1       False
         2       False
         3       False
         4       False
                 ...
Table 3  7065    False
         7066    False
         7067    False
         7068    False
         7069    False
Length: 9135, dtype: bool

In [62]:
df.shape

(9135, 11)

In [63]:
num_nans = df.isna().sum() # Check how many nulls values do we have.
print(num_nans)

customer                        1
state                           1
gender                        123
education                       1
customer lifetime value      7078
income                          1
monthly premium auto            1
number of open complaints    7071
policy type                     1
vehicle class                   1
total claim amount              1
dtype: int64

In [64]:
df.info() # Checking the type

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 9135 entries, ('Table 1', 0) to ('Table 3', 7069)
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9134 non-null   object
 1   state                      9134 non-null   object
 2   gender                     9012 non-null   object
 3   education                  9134 non-null   object
 4   customer lifetime value    2057 non-null   float64
 5   income                     9134 non-null   float64
 6   monthly premium auto       9134 non-null   float64
 7   number of open complaints  2064 non-null   float64
 8   policy type                9134 non-null   object
 9   vehicle class              9134 non-null   object
 10  total claim amount         9134 non-null   float64
dtypes: float64(5), object(6)
memory usage: 1.1+ MB

In [65]:
# Calulate the mean
lifetime_value_mean= df['customer lifetime value'].mean() 
income_mean = df['income'].mean()
premium_auto_mean = df['monthly premium auto'].mean() 
open_complaints_mean = df['number of open complaints'].mean() 
claim_amount_mean = df['total claim amount'].mean()

In [66]:
# Replace nulls values per the mean so we can make analysis with them. 
df['customer lifetime value'] = df['customer lifetime value'].fillna(lifetime_value_mean)
df['income'] = df['income'].fillna(income_mean)
df['monthly premium auto'] = df['monthly premium auto'].fillna(premium_auto_mean)
df['number of open complaints'] = df['number of open complaints'].fillna(open_complaints_mean)
df['total claim amount'] = df['total claim amount'].fillna(claim_amount_mean)

In [67]:
# Change categorical values per there mode. 
df.fillna(df.select_dtypes(include='object').mode().iloc[0], inplace=True)

In [68]:
num_nans = df.isna().sum() # Check how many nulls values do we have.
print(num_nans)

customer                     0
state                        0
gender                       0
education                    0
customer lifetime value      0
income                       0
monthly premium auto         0
number of open complaints    0
policy type                  0
vehicle class                0
total claim amount           0
dtype: int64

In [69]:
df.tail()

             customer       state gender education  customer lifetime value  \
Table 3 7065  LA72316  California      M  Bachelor            780264.024492
        7066  PK87824  California      F   College            780264.024492
        7067  TD14365  California      M  Bachelor            780264.024492
        7068  UP19263  California      M   College            780264.024492
        7069  Y167826  California      M   College            780264.024492

               income  monthly premium auto  number of open complaints  \
Table 3 7065  71941.0                  73.0                   0.382267
        7066  21604.0                  79.0                   0.382267
        7067      0.0                  85.0                   0.382267
        7068  21941.0                  96.0                   0.382267
        7069      0.0                  77.0                   0.382267

                 policy type  vehicle class  total claim amount
Table 3 7065   Personal Auto  Four-Door Car              198.23
        7066  Corporate Auto  Four-Door Car              379.20
        7067  Corporate Auto  Four-Door Car              790.78
        7068   Personal Auto  Four-Door Car              691.20
        7069  Corporate Auto   Two-Door Car              369.60

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [70]:
df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv")

In [71]:
df.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 27 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   unnamed:_0                     10910 non-null  int64
 1   customer                       10910 non-null  object
 2   state                          10910 non-null  object
 3   customer_lifetime_value        10910 non-null  float64
 4   response                       10910 non-null  object
 5   coverage                       10910 non-null  object
 6   education                      10910 non-null  object
 7   effective_to_date              10910 non-null  object
 8   employmentstatus               10910 non-null  object
 9   gender                         10910 non-null  object
 10  income                         10910 non-null  int64
 11  location_code                  10910 non-null  object
 12  marital_status                 10910 non-null  object
 13  monthly_premium_auto           10910 non-null  int64
 14  months_since_last_claim        10910 non-null  float64
 15  months_since_policy_inception  10910 non-null  int64
 16  number_of_open_complaints      10910 non-null  float64
 17  number_of_policies             10910 non-null  int64
 18  policy_type                    10910 non-null  object
 19  policy                         10910 non-null  object
 20  renew_offer_type               10910 non-null  object
 21  sales_channel                  10910 non-null  object
 22  total_claim_amount             10910 non-null  float64
 23  vehicle_class                  10910 non-null  object
 24  vehicle_size                   10910 non-null  object
 25  vehicle_type                   10910 non-null  object
 26  month                          10910 non-null  int64
dtypes: float64(4), int64(6), object(17)
memory usage: 2.2+ MB

In [73]:
# Changing all colums to the same format
df.columns = df.columns.str.replace('_', ' ')
df.rename(columns={'employmentstatus': 'employment status'}, inplace=True)

# Deleting this column because it wasn't necessary, we already have a automatic numerical column
df = df.drop("unnamed: 0", axis=1)

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 26 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   customer                       10910 non-null  object
 1   state                          10910 non-null  object
 2   customer lifetime value        10910 non-null  float64
 3   response                       10910 non-null  object
 4   coverage                       10910 non-null  object
 5   education                      10910 non-null  object
 6   effective to date              10910 non-null  object
 7   employment status              10910 non-null  object
 8   gender                         10910 non-null  object
 9   income                         10910 non-null  int64
 10  location code                  10910 non-null  object
 11  marital status                 10910 non-null  object
 12  monthly premium auto           10910 non-null  int64
 13  months since last claim        10910 non-null  float64
 14  months since policy inception  10910 non-null  int64
 15  number of open complaints      10910 non-null  float64
 16  number of policies             10910 non-null  int64
 17  policy type                    10910 non-null  object
 18  policy                         10910 non-null  object
 19  renew offer type               10910 non-null  object
 20  sales channel                  10910 non-null  object
 21  total claim amount             10910 non-null  float64
 22  vehicle class                  10910 non-null  object
 23  vehicle size                   10910 non-null  object
 24  vehicle type                   10910 non-null  object
 25  month                          10910 non-null  int64
dtypes: float64(4), int64(5), object(17)
memory usage: 2.2+ MB

In [75]:
df.shape

(10910, 26)

In [76]:
#Delete duplicates rows
df_drop_duplicates = df.drop_duplicates()
df = df_drop_duplicates.copy() # Save it

In [77]:
# Check for duplicates after cleaning
duplicated_rows_after_cleaning = df.duplicated()
duplicated_rows_after_cleaning

0        False
1        False
2        False
3        False
4        False
         ...
10905    False
10906    False
10907    False
10908    False
10909    False
Length: 10467, dtype: bool

In [78]:
df.shape # To see more cleary how many we have left

(10467, 26)

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [79]:
df.head()

,customer,state,customer lifetime value,response,coverage,education,effective to date,employment status,gender,income,...,number of policies,policy type,policy,renew offer type,sales channel,total claim amount,vehicle class,vehicle size,vehicle type,month
0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,48029,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,0,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,22139,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,49078,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,23675,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [80]:
df["sales channel"].unique()

array(['Agent', 'Call Center', 'Branch', 'Web'], dtype=object)

In [81]:
# Table showing the total revenue for each sales channel
df[["sales channel", "total claim amount"]].groupby("sales channel").sum().round(2) # Round decimals to two decimals

               total claim amount
sales channel
Agent                  1748923.49
Branch                 1259333.44
Call Center             889094.77
Web                     676658.10

**Analysis**

By looking at the table we can determine which sales channel generated the most revenue in terms of total turnover. 

1. Channel with the highest turnover: Looking at the values provided in the table and we can conclude that the channel with the highest value is "Agent" with a total turnover of 1748923.56.

2. Compare the channels' revenues: if we compare the revenues of the different channels, we can see that the revenues of the "Branch", "Call Center" and "Web" channels are very close to each other, with values of 1259333.76, 889094.95 and 676658.07 respectively, suggesting that these channels have similar performance in terms of turnover.

3. Identify opportunities and make decisions: based on the data provided, we can identify opportunities to allocate resources or adjust marketing strategies. For example, taking into account that the "Agent" channel is generating significantly more revenue than the other channels, we could consider investing more resources in that channel to maximize revenue.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [ ]:
# Your code goes here